Revit 2027 API
AnalysisDisplayStyle.GetMarkersAndTextSettings Method
 Get markers and text settings object from the style.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AnalysisDisplayMarkersAndTextSettings GetMarkersAndTextSettings()
Public Function GetMarkersAndTextSettings As AnalysisDisplayMarkersAndTextSettings
public:
AnalysisDisplayMarkersAndTextSettings^ GetMarkersAndTextSettings()
member GetMarkersAndTextSettings : unit -> AnalysisDisplayMarkersAndTextSettings
Return Value
AnalysisDisplayMarkersAndTextSettings
Exceptions
Exception | Condition
InvalidOperationException |  markers and text settings were not created with the object.
See Also
Reference
AnalysisDisplayStyle Class
Autodesk.Revit.DB.Analysis Namespace